Repository: 84000/data-translation-memory
Catalog: toh64-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་ཤིན་ཏུ་ལེགས་པར་རྟོགས་པའི་ཕྱིར་དང་། སྤྱོད་པ་བཞི་པོ་འདི་དག་དང་མཚུངས་པར་ལྡན་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་པས་དེ་དག་གི་དབང་པོ་དང་། རང་བཞིན་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་དང་།
en: The bodhisattvas, because they understand very well the nature of the dharmadhātu, and since they contemplate those sentient beings of the four temperaments as they really are, teach Dharma according to their faculties and natures.

source: སེམས་ཅན་གྱི་ཁམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པར་བྱེད་པས་གཉིས་སུ་འགྱུར་བའི་མཚན་ཉིད་ཀྱང་མེད་དེ། ཆོས་ཀྱི་དབྱིངས་དང་། སེམས་ཅན་གྱི་ཁམས་ཇི་སྙེད་པ་དེ་དག་གཉིས་སུ་མེད་ཅིང་ཐ་དད་པ་མེད་པར་གསལ་བར་མཐོང་བའི་ཕྱིར་རོ། །
en: However, since they contemplate the dharmadhātu and the realms of sentient beings as they are, they also do not have a conception of duality, because they see clearly that those categories of the dharmadhātu and the realms of sentient beings have no duality and no differences.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་ནི་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཚན་མ་ཡང་མེད་ལ་རྣམ་པར་གཞག་པ་ཡང་མེད་དོ། །
en: “Vidyutprāpta, to give an analogy, it is like this. In space, there is no characteristic of various differences, and there is no differentiation.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་ལེགས་པར་སོ་སོར་བརྟགས་ནས་ཆོས་ཐམས་ཅད་མཚན་ཉིད་གཅིག་ཏུ་འཇུག་པར་རྟོགས་པ་དང་།
en: In the same way, the bodhisattvas, since they contemplate the dharmadhātu very well, recognize that all dharmas enter into a single characteristic.

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས་སེམས་ཅན་གྱི་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་ནི་ཐ་དད་དུ་གྱུར་པ་མེད་དོ། །
en: By the power of their former vows, they teach Dharma in various ways according to the temperaments of sentient beings, even though in the dharmadhātu there are no differences.

source: གློག་ཐོབ་ཆ་མཉམ་པའི་སྤྱོད་པ་འདི་ལ་ཉི་ཁྲི་ཆིག་སྟོང་ཡོད་པ་དང་། སྤྱོད་པ་གཞན་གཏོགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གྱུར་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་སོ་སོར་བརྟགས་ནས་ཐམས་ཅད་གསལ་བར་རྟོགས་པར་འགྱུར་ཏེ།
en: “Vidyutprāpta, since the bodhisattvas have analyzed individually the twenty-one thousand actions of one with an equally proportioned temperament, and the actions belonging to the other categories of temperaments, making a total of eighty-four thousand, they understand them all clearly.

source: འདི་ལྟ་སྟེ་དཔེར་ན་སྨན་པ་མཁས་པ་ནད་དང་སྨན་གཏོང་བ་རབ་ཏུ་ཤེས་པ་བཞིན་དུ་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་ཆོས་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆ་མཉམ་པ་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ། །
en: To give an analogy, it is like this. Just as a skillful doctor wisely knows illnesses and how to administer medicine, the bodhisattvas teach Dharma by means of their effortless wisdom. This is called the bodhisattva mahāsattvas’ treasure for those with an equally proportioned temperament.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ཐོབ་པར་གྱུར་ན་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བསྐལ་པ་འམ། བསྐལ་པ་ལས་ལྷག་པར་དེ་དག་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྗོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཐབས་མཁས་པས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་སྤྱོད་པ་དེ་དག་གི་མཐའ་ཡང་རྙེད་པར་མི་འགྱུར་ལ།
en: When bodhisattvas obtain this treasure, for the sake of sentient beings, they teach Dharma, for a kalpa or more than a kalpa, according to their desires, in various words.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་མཚན་ཉིད་ལེགས་པར་བཤད་པས་ཐོབ་པའི་ཆ་མཉམ་པའི་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ།། །།བམ་པོ་གཉིས་པ་སྟེ་ཐ་མ།
en: This is called the bodhisattvas’ treasure for those with an equally proportioned temperament, which is obtained due to their good explanation of the undifferentiated nature of the dharmadhātu.

source: གཞན་ཡང་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་དེས་དེ་ལྟ་བུའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པས་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་།
en: “Furthermore, Vidyutprāpta, the bodhisattvas, since they have perfected that sort of wisdom, are totally aware, with their skill in means, of sentient beings’ faculties, conduct, and aspirations.

source: སྤྱོད་པ་དང་། བསམ་པ་ཡང་ཐབས་མཁས་པས་རབ་ཏུ་རྟོགས་པས་གལ་ཏེ་འདོད་ཆགས་མང་བའི་སེམས་ཅན་མཐོང་བར་གྱུར་ན། དེ་དག་རབ་ཏུ་གདུལ་ཞིང་དེ་དག་གི་ནད་གསོ་བའི་ཕྱིར་སོ་སོའི་སྐྱེ་བོ་དང་འཐུན་པར་འདོད་པ་རྣམས་ལ་ཡོངས་སུ་སྤྱོད་པ་དང་། བུ་དང་། ཆུང་མ་དང་།
en: If they see sentient beings who have much desire, in order to tame them and treat their disease, they appear like an ordinary person, enjoying objects of desire, provided with children, a wife, and the comforts of a home.

source: ཁྱིམ་གྱི་སོ་ཆིས་ཕུན་སུམ་ཚོགས་པ་སྟོན་པར་བྱེད་ཀྱང་པད་མ་བཞིན་དུ་དེས་གོས་ཞིང་མངོན་པར་ཞེན་པར་གྱུར་པ་མེད་དོ། །
en: However, like a lotus, they are not contaminated or attached.

source: སེམས་ཅན་གང་གཏི་མུག་ཅིང་བློ་དང་མི་ལྡན་པ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པ་མི་ཤེས་པས་འདི་སྙམ་དུ་བློ་དང་ལྡན་པ་སུ་ཞིག་སོ་སོའི་སྐྱེ་བོ་དང་ཐ་མི་དད་པར་འདོད་པ་རྣམས་ཉམས་སུ་ལེན་པར་བྱེད་ཅེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་འདི་ནི་བྱང་ཆུབ་སྤངས་པ་ཡིན་ནོ་སྙམ་དུ་སེམས་པར་བྱེད་དོ། །
en: Sentient beings who are deluded and lack intelligence, because they do not know the bodhisattvas’ skill in means, think, ‘What intelligent person would be attached to objects of desire just like an ordinary person?

source: སེམས་ཅན་དེ་ལྟ་བུ་དེ་དག་ནི་སེམས་ཡོངས་སུ་མི་གཙང་བའི་ཕྱིར་ཞེ་སྡང་ཆེན་པོ་སྐྱེས་ནས་གུས་པར་མི་འགྱུར་བས་ལས་དེའི་དབང་གིས་ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྷུང་བར་གྱུར་ཀྱང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་གསང་བས་གདུལ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་ཁ་ན་མ་ཐོ་བའི་རྣམ་པ་ཡོངས་སུ་ཟད་ནས་གདོན་མི་ཟ་བར་མཉམ་པ་ཉིད་འཐོབ་པ་ལ་རབ་ཏུ་འགོད་པར་བྱེད་དོ། །
en: Therefore, this person has no enlightenment.’ Those kinds of sentient beings, because their minds are completely impure, give rise to great hatred, and since they are not reverent, when due to their karma their bodies fail, they fall into the great hell after their death. However, because the bodhisattvas very secretly instruct them, their various faults are completely eliminated, and they are all fully established in the attainment of equanimity.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་མེ་རབ་ཏུ་འབར་བ་ནི་རྩྭ་དང་ཤིང་དང་ཕྲད་པར་གྱུར་པ་ན་ཐམས་ཅད་རབ་ཏུ་འབར་ཞིང་མེའི་ཕུང་པོ་ཉིད་དུ་མངོན་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: “To give an analogy, it is like this. When a strongly blazing fire meets grass and trees, they all burn fiercely and are transformed into the mass of the fire itself.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡེ་ཤེས་ཀྱི་མེ་འབར་བར་གྱུར་པ་ན་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། དགེ་བ་དང་། མི་དགེ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དང་ལྷན་ཅིག་འགྲོགས་ཤིང་ཐམས་ཅད་རབ་ཏུ་འབར་ནས་ཤེས་རབ་ཉིད་དུ་མངོན་པར་འགྲུབ་པར་འགྱུར་ཏེ།
en: Similarly, for the bodhisattvas, when they kindle the fire of wisdom, sentient beings’ desire, hatred, and confusion, their good and their evil, whatever they are, meet the bodhisattva, and all burn up and are transformed into wisdom.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མ་འདྲེས་པའི་ཆོས་ཞེས་བྱའོ།།
en: This is called the extraordinary quality of the bodhisattva.

source: གཞན་ཡང་འདི་ལྟ་སྟེ། དཔེར་ན་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་མ་འདྲེས་པའི་མཚན་ཉིད་ནི་འདི་ལྟ་སྟེ། རིན་པོ་ཆེ་སྣ་བཞི་ལས་མངོན་པར་གྲུབ་པ་ཡིན་ཏེ།
en: “Furthermore, to give another analogy, the extraordinary quality of the king of mountains, Sumeru, is that it is formed from four types of jewels.

source: སེམས་ཅན་རྣམས་ཀྱང་དེའི་རྗེས་སུ་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཚན་ཉིད་དུ་གྱུར་པར་བྱེད་དེ།
en: Sentient beings, too, have qualities of various sorts—blue, yellow, red, and white—that correspond to those jewels.

source: གལ་ཏེ་བཻ་ཌཱུརྱའི་ངོས་སུ་ཕྱིན་ན་ནི་ཐམས་ཅད་ཀྱང་བཻ་ཌཱུརྱའི་ཁ་དོག་གཅིག་པ་ཉིད་དུ་འགྱུར་བར་བྱེད་དོ། །
en: If they go to the lapis lazuli side of Sumeru, they all become the single color of lapis lazuli.

source: གསེར་གྱི་ཁ་དོག་གི་ངོས་སུ་ཕྱིན་ན་ནི་ཐམས་ཅད་གསེར་གྱི་ཁ་དོག་ཉིད་དུ་འགྱུར་བར་བྱེད་དོ། །
en: If they go to the gold-colored side, they all become gold-colored.

source: དངུལ་དང་། ཆུ་ཤེལ་གྱི་ཁ་དོག་ཏུ་འགྱུར་བ་ཡང་དེ་བཞིན་ནོ། །
en: In the same way, they become silver-colored or crystal-colored.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མ་འདྲེས་པའི་ཆོས་ཐོབ་པས་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། དགེ་བ་དང་། མི་དགེ་བ་ཇི་སྙེད་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐད་དུ་ཕྱིན་ཅིང་ལྷན་ཅིག་འགྲོགས་པར་གྱུར་ན་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ལ་འཇུག་པ་ཉིད་དུ་འགྱུར་བར་བྱེད་ཀྱང་།
en: In just that way, since the bodhisattvas, too, have obtained extraordinary qualities, whatever the desire, hatred, confusion, good, or evil of sentient beings, when they go into the presence of the bodhisattvas and associate with them, they all enter into the wisdom of the bodhisattva.

source: དེའི་སེམས་མི་གཙང་ཞིང་རང་གི་སྡིག་པའི་ལས་ཀྱི་དབང་གིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ལྷུང་བར་གྱུར་པས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་མ་འདྲེས་པའི་ཡོན་ཏན་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་ཁ་ན་མ་ཐོ་བའི་རྣམ་པར་སྨིན་པ་ཟད་པའི་འོག་ཏུ་གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལ་འགོད་པར་བྱེད་དོ། །གློག་ཐོབ་སྔོན་བྱུང་བ་འདས་པའི་བསྐལ་པ་ཚད་མེད། དཔག་ཏུ་མེད།
en: However, when their minds are impure, and due to their own sinful karma, they fall into the birth destiny of hell beings or animals or the world of the dead, in this case, by the power of the bodhisattvas’ extraordinary qualities and vow, after their sinful karmic consequences are exhausted, they are definitely set to obtain unsurpassed, perfect enlightenment in the future.

source: གྲངས་མེད་པ་ན་སྙིགས་མ་ལྔའི་དུས་ཀྱི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་ཕུང་པོ་ཡོན་ཏན་གྱི་སྒྲ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Vidyutprāpta, in the period of the five defilements, innumerable, unlimited, incalculable kalpas in the past, a tathāgata, an arhat, a perfectly enlightened one, one endowed with knowledge and conduct, a sugata, a knower of the world, a supreme one, a charioteer who tames people, a teacher of gods and humans, a buddha bhagavān named Jewel Heap Merit Voice appeared.

source: དེའི་ཚེ་སྐྱེ་དགུ་རྣམས་ཚེ་ལོ་བརྒྱ་ཉི་ཤུ་ཐམ་པར་གྱུར་ཏེ། ད་ལྟར་ང་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: At that time, all beings lived for a hundred twenty years, as I do today.

source: དེའི་ཚེ་སེམས་ཅན་རྣམས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཤིན་ཏུ་ཆེ་སྟེ།
en: “At that time, sentient beings’ desire, hatred, and confusion were great.

source: ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཟིལ་གྱིས་ནོན་པས་ཕ་མ་དང་། ཕུ་ནུ་དང་། གྲོགས་པོའི་ཡིད་དང་འགལ་བར་བྱེད་པ། མཁན་པོ་དང་། སློབ་དཔོན་གྱི་རྗེས་སུ་མི་འབྲང་བ།
en: Since they were overwhelmed by afflictions, fathers and mothers, older and younger brothers, and friends disagreed, and they did not follow their teachers and masters.

source: བྱས་པ་དྲིན་དུ་མི་གཟོ་བ།
en: They did not acknowledge kind deeds.

source: རྟག་པར་གནོད་སེམས་དང་བཅས་པ། གཡོ་སྒྱུ་དང་རྐུན་བུའི་སེམས་དང་ལྡན་པ།
en: They were always full of malicious thoughts, and they had tricky and thieving minds.

source: ཕན་ཚུན་གཅིག་ལ་གཅིག་གནོད་པ་བྱེད་པ།
en: They hurt each other.

source: ཚུལ་བཞིན་མ་ཡིན་པར་སྤྱོད་པ།
en: They behaved improperly.

source: སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་ལ་གུས་པ་མེད་པ།
en: They did not have respect for the Buddha, Dharma, and Saṅgha.

source: སེར་སྣས་ཟིལ་གྱིས་ནོན་པས་ཡི་དགས་ཀྱི་ཆོས་སྤྱོད་པའི་སེམས་ཅན་དེ་ལྟ་བུ་ཤ་སྟག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་གནས་པར་གྱུར་པས་ནི་ཤིན་ཏུ་གདུལ་དཀའ་བར་གྱུར་ཏོ། །
en: Only beings like these, who, because they were overcome with stinginess, practiced the custom of pretas, lived in that buddha field, and they were very difficult to discipline.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་ཡང་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས་དུས་ངན་པ་དེའི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏེ།
en: “Even in such a bad era, that bhagavān, due to the power of his former vow, realized unsurpassed, perfect enlightenment and became a completely enlightened buddha.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ཉན་ཐོས་ཆེན་པོའི་ཚོགས་ནི་ཉི་ཁྲི་ཉིས་སྟོང་མངའ་བར་གྱུར་ཏོ། །
en: That bhagavān had twenty-two thousand śrāvakas.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱ་ཆེར་བྱིན་པ་ཞེས་བྱ་བ་འཛམ་བུའི་གླིང་ལ་དབང་བའི་དབང་ཕྱུག་དང་ལྡན་པ།
en: “A king named Extensively Giving was then the sovereign who governed Jambudvīpa.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་སེམས་ཤིན་ཏུ་དང་བར་གྱུར་པ་ཞིག་ཡོད་པ་དེས་དེ་བཞིན་གཤེགས་པ་དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་དབྱར་ཟླ་བ་གསུམ་སྤྱན་དྲངས་ཏེ་མཆོད་པ་རྒྱ་ཆེར་བཤམས་ནས་མཆོད་ཅིང་རིམ་གྲོ་བྱས་སོ། །
en: He was sincere about the teaching of the Buddha, and he invited that tathāgata together with the saṅgha of śrāvakas for the three summer months. Laying out extensive offerings, he worshiped and performed rituals.

source: དེའི་ཚེ་དགེ་སློང་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ།
en: “At that time, a monk named Stainless was endowed with eloquence.

source: ཆོས་སྟོན་པའི་ཐབས་ལ་མཁས་པས་འཁོར་མང་པོ་རྣམས་ཉན་པར་སྤྲོ་བ།
en: Because he was skilled at teaching the Dharma, a great assembly was eager to hear him.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་རྟག་པར་ངལ་བ་མེད་པ།
en: He never tired of bringing sentient beings to maturity.

source: རེ་བ་མེད་པར་ཆོས་སྟོན་པ། མདོག་གསལ་ཞིང་གསོང་པོར་སྨྲ་བ།
en: He taught the Dharma without expectation and spoke sincerely with a shining complexion.

source: གཟུགས་དང་སྟོབས་ཕུན་སུམ་ཚོགས་པ། བྱད་བཞིན་སྡུག་ཅིང་མཛེས་པ།
en: He was endowed with a good appearance and strength, and his face was kind and handsome.

source: སེམས་ཅན་རྣམས་ཀྱིས་མཐོང་བར་མོས་ཤིང་རིམ་གྲོ་དང་།
en: Sentient beings longed to see him.

source: བཀུར་སྟི་དང་། བླ་མར་བྱེད་ཅིང་བསྔགས་པ་བརྗོད་པ་ཞིག་ཡོད་དེ།
en: He was served and respected, revered and praised.

source: དགེ་སློང་གསར་བུ་དག་ཀྱང་རྟག་པར་དྲི་མ་མེད་པའི་རྗེས་སུ་འབྲང་ཞིང་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་འབྱུང་ཞིང་འཇུག་པ་དག་ལ་ཐོགས་པ་མེད་པར་གྱུར་པས་གོས་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་སྟན་དང་། ན་བའི་གསོས་སྨན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཀྱང་རིམ་གྲོ་བྱས་པར་གྱུར་ཏོ། །
en: Beginning monks also frequently followed Stainless and appeared in the king’s palace, entering freely, and they showed their respect with various garments, food, drink, bedding, and medicines.

source: དེའི་ཚེ་འཁོར་མང་པོ་དེ་ལས་དགེ་སློང་ཕལ་ཆེར་ལུས་ཀྱི་སྡོམ་པ་དང་། སེམས་ཀྱི་ཤེས་རབ་བསྒོམ་པ་མི་ཤེས་པ།
en: “Many monks from that great assembly did not know how to practice bodily restraint or wisdom of the mind.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་གུས་པ་མེད་པ།
en: They did not have respect for the Buddha, Dharma, or Saṅgha.

source: རྟག་པར་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། བདག་ཏུ་ལྟ་བ་ལ་སོགས་པ་དང་ལྡན་པ།
en: They had false views of permanence, nihilism, self, and so forth.

source: སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྐུར་བ་འདེབས་པ།
en: They rejected the Buddha’s teaching.

source: རྣམ་པར་གཡེང་ཞིང་གདུལ་དཀའ་བ།
en: They were very agitated and hard to discipline.

source: དབང་པོ་རྣམས་མི་སྡོམ་པ།
en: Their senses were unrestrained.

source: ཆོས་བཞིན་མ་ཡིན་པ་ལ་གནས་པ།
en: They abided in wickedness.

source: དགེ་སྦྱོང་གི་ཚུལ་མེད་པར་བདག་ཉིད་དགེ་སྦྱོང་དུ་ཁས་འཆེ་བ།
en: Without having the conduct of śramaṇas, they claimed to be śramaṇas.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཐམས་ཅད་ལོག་པར་ཞུགས་པ་ཤ་སྟག་གནས་པར་གྱུར་ཏོ། །
en: Their actions of body, speech, and mind were all entirely based in depravity.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་དབྱར་འདས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་།
en: “That bhagavān entered nirvāṇa after the rainy season, and King Extensively Giving cremated the bhagavān’s body in a fire of red sandalwood.

source: རྒྱལ་པོ་རྒྱ་ཆེར་བྱིན་པས་ཙན་དན་དམར་པོས་སྐུ་ཞུགས་ལ་བཞེན་ནས་མཆོད་པ་བྱས་ཏེ་རིང་བསྲེལ་གྱི་མཆོད་རྟེན་ངོས་བཞི་ཀུན་ཏུ་ཙན་དན་དམར་པོའི་མུ་ཁྱུད་ཀྱིས་བསྐོར་བ། པད་མ་གསེར་གྱི་ཁ་དོག་དང་ལྡན་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་བརྩིགས་སོ། །
en: He made offerings and built eighty million reliquary stūpas surrounded on four sides by red sandalwood railings, with golden lotuses.

source: དེའི་ཚེ་དགེ་སློང་དྲི་མ་མེད་པ་ནི་བཅོམ་ལྡན་འདས་དེས་མང་དུ་ཐོས་པའི་མཆོག་ཏུ་ལུང་བསྟན་པས་དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དམ་པའི་ཆོས་རྒྱ་ཆེར་སྤེལ་ཏེ།
en: “The monk Stainless had been given a prophecy by that bhagavān that he would be the most learned and would transmit the true doctrine widely after that tathāgata entered nirvāṇa.

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་གང་དང་གང་དུ་སོང་བ་དེར་སེམས་ཅན་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་ཡོངས་སུ་བཏུལ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་པར་གྱུར་ཏོ། །
en: Whatever village, city, or marketplace he went to, he would convert innumerable hundreds of thousands of sentient beings and establish them in unsurpassed, perfect enlightenment.

source: དེའི་ཚེ་དགེ་སློང་སྡིག་ཅན་མང་པོ་རྣམས་རྣལ་འབྱོར་ཁོང་དུ་མ་ཆུད་པ།
en: “Many evil monks then did not understand the practice of yoga.

source: རྟག་པར་ཕྲག་དོག་དང་བཅས་པ།
en: They were always jealous.

source: བདུད་ཀྱིས་བསླུས་པ་རྣམས་རྒྱལ་པོ་དེ་ག་ལ་བ་དེར་དོང་སྟེ་འདི་སྐད་དུ་རྒྱལ་པོས་བཀུར་བའི་དགེ་སློང་དྲི་མ་མེད་པ་ནི་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འབྱུང་ཞིང་འཇུག་པ་ལ་ཐགས་ཐོགས་མ་མཆིས་ཏེ།
en: Confused by Māra, they went to the king and said, ‘The monk Stainless, who is respected by the king, goes in and out of the palace freely.

source: དགེ་སློང་འདི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་མ་ལགས་ལ།
en: This monk is not yet free from desire.

source: དུས་མ་ལགས་པར་ཡང་ཟས་འཚལ་ཏེ།
en: He asks for food at the wrong time.

source: སྤོས་དང་ཕྲེང་བ་དག་གིས་ཀྱང་ལུས་བརྒྱན་པར་བགྱིད་པས་ཡང་དག་པར་ཚངས་པར་སྤྱོད་པ་མ་ལགས་པས་མཆོད་པ་མཛད་པའི་མི་རིགས་སོ། །
en: He adorns his body with perfume and garlands, and since he is not truly chaste, it is not right for him to make offerings.

source: བདག་ཅག་ནི་དོན་འདིའི་སླད་དུ་འདིར་མཆིས་ནས་རྒྱལ་པོ་ལ་གསོལ་བ་ལགས་ཀྱིས།
en: For this reason, we have come here to explain this to the king.

source: སླད་ཀྱིས་འགྱོད་པར་ཡང་མ་མཛད་ཅིག །
en: Do not have regrets later.

source: སངས་རྒྱས་ཀྱི་ཡང་དག་པའི་བསྟན་པ་ལ་ཐུགས་མི་ཆེས་པ་ཡང་མི་བསྐྱེད་དུ་གསོལ་ཞེས་སྨྲས་སོ། །
en: Please do not disbelieve the true teachings of the Buddha.’

source: དེའི་ཚེ་བདུད་སྡིག་ཅན་ཞེས་བྱ་བ་ཞིག་ཀྱང་བདག་ཉིད་དགེ་སློང་གི་གཟུགས་སུ་བསྒྱུར་ནས་རྒྱལ་པོ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་སྔ་མ་བཞིན་དུ་སྨྲས་སོ། །
en: “At that time, there was a māra named Wicked. He changed himself into the shape of a monk, and he went to the king and spoke in the same way as above.

source: དེའི་ཚེ་རྒྱལ་པོ་རྒྱ་ཆེར་བྱིན་པས་ཡང་དང་ཡང་དུ་དེ་སྐད་སྨྲས་པ་ཐོས་ཀྱང་འདི་སྙམ་དུ་དགེ་སློང་དྲི་མ་མེད་པ་ནི་རབ་ཏུ་བརྩོན་ཞིང་བློ་དང་ལྡན་པས་བདག་གིས་བླ་མར་བཀུར་བ་ཡིན་ཏེ།
en: “King Extensively Giving, although he heard the same thing repeated, thought, ‘Since the monk Stainless is very diligent, I respect him as my teacher.

source: དངོས་པོ་འདི་ལྟ་བུ་བྱེད་པ་ནི་གནས་མེད་དོ་སྙམ་མོ། །
en: Something like this is impossible.’

source: དེ་ནས་དེའི་ཚེ་བདུད་ཀྱི་འཁོར་རྣམས་པར་སྣང་ལས་ལུས་ཕྱེད་བསྟན་ནས་རྒྱལ་པོ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། རྒྱལ་པོ་བཟོ་ཡི་སྒྱུ་རྩལ་སློབས། །
en: “Then the māra’s retinue showed half their bodies and spoke in verse to the king: “ ‘King, study the practical arts.

source: དུས་ཚོད་དག་ལ་མཁས་པར་གྱིས། །
en: Be skillful about the right moments.

source: རྒྱལ་པོས་དེ་ནི་མ་ཤེས་ན། །མི་རྒྱལ་རྟགས་དང་ལྡན་མ་ཡིན། །
en: If the king does not know these things, He does not have the marks of a king of humans.

source: སངས་རྒྱས་ཉན་ཐོས་དགྲ་བཅོམ་པ། །ཡེ་ཤེས་ཆེན་པོ་ལྡན་པ་ཡི། །ཚིག་དག་ལ་ནི་མི་རྟེན་པར། །
en: “ ‘The Buddha’s arhat disciples Are endowed with great wisdom, but They do not rely on the words of Stainless.

source: ཅི་ཡི་ཕྱིར་ན་ཆད་པར་ལྟ། །
en: Why?

source: དགེ་སློང་རྣམས་ནི་ཕན་གདགས་ཕྱིར། །ཁྱོད་ལ་བདེན་ཚིག་སྨྲ་བ་ཡིན། །
en: Because they are nihilistic. “ ‘Monks, in order to help, Tell you the truth.

source: ཆད་སྨྲ་ངན་འགྲོར་འགྲོ་བའི་མི། །ཡང་དག་ཚངས་སྤྱོད་མ་ཡིན་པས། །
en: Nihilistic men who go to bad destinies Are not truly chaste.

source: དེ་ནི་རྒྱལ་པོའི་ཕོ་བྲང་དུ། །བཙུན་མོ་དག་དང་ལྷན་ཅིག་རྩེ། །
en: “ ‘That one, in the king’s palace, Enjoys himself with your consorts.

source: རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ཡིས། །ལེགས་པར་རྟོགས་ལ་ཐེ་ཚོམ་སོལ། །
en: The king and his retinue Should investigate carefully and dispel doubt.’

source: རྒྱལ་པོས་དངོས་པོ་འདི་ཐོས་པས། །སེམས་ལ་སྐྲག་ཅིང་མྱ་ངན་སྐྱེས། །
en: “When the king heard about this matter, He suffered in his mind from fear.

source: འཁོར་རྣམས་དང་ནི་ལྷན་ཅིག་ཏུ། །མྱུར་ཞིང་རིངས་པར་ཕོ་བྲང་དོང་། །
en: Together with his retinue, He proceeded quickly to his palace.

source: དེ་ཚེ་དྲི་མེད་ཕོ་བྲང་ནང་། །ཆོས་རྣམས་རང་བཞིན་སྟོང་པ་དང་། །བདག་དང་སེམས་ཅན་མེད་པ་ཡི། །དམ་པའི་དོན་ནི་སྟོན་པར་བྱེད། །
en: “At that time, Stainless, in the palace, Taught the highest truth That dharmas are empty by nature.

source: རྒྱལ་པོ་དམག་འཁོར་བཅས་པ་རྣམས། །ཐམས་ཅད་བདུད་ཀྱིས་བསླུས་པས་ན། །
en: “The king, together with his army, Were all deceived by the māra.

source: ཕོ་བྲང་ནང་གི་བཙུན་མོ་རྣམས། །དགེ་སློང་ཡོངས་བསྐོར་མཐོང་བ་དང་། །
en: They saw the consorts in the palace Surround the monk.

source: ཞེ་སྡང་གླང་ཆེན་མྱོས་འདྲ་བས། །གཤེད་མ་དག་ལ་རབ་བསྒོ་བ། །དགེ་སློང་ང་ཡི་བཙུན་མོ་བསླུས། །
en: “The king’s hatred was like that of a great intoxicated elephant, And he ordered the executioners, ‘The monk has deceived my consorts.

source: སྡུག་བསྔལ་ཆོས་ཀྱི་ཆད་པས་ཆོད། །
en: Condemn him to a painful punishment.’

source: བློན་པོ་འཁོར་དང་བཅས་པ་རྣམས། །ཐམས་ཅད་བདུད་ཀྱིས་ཟིན་པས་ན། །དགེ་སློང་ཉེས་པ་མེད་པ་ལ། །སེམས་ཀྱིས་གནོད་པ་བྱ་བར་བསམས། །
en: “The ministers, together with their retinues, All under the control of the māra, Thought the innocent monk Must be harmed.

source: གཤེད་མ་མཚོན་ཐོགས་འོངས་པ་དང་། །དྲི་མེད་སྙིང་བརྩེ་མཆི་མ་བྱུང་། །
en: “An executioner came, holding weapons, And Stainless, in compassion, shed tears.

source: རྒྱལ་པོས་ཁྱོད་ནི་ཆོས་མིན་ན། །
en: The king said, ‘You are unrighteous.

source: ཅི་ཡི་ཕྱིར་ན་མཆི་མ་བྱུང་། །
en: Why are you crying?’

source: དྲི་མེད་རྒྱལ་པོ་ལ་སྨྲས་པ། །དངོས་པོ་འདི་ནི་ཡིད་ཆེས་དཀའ། །
en: “Stainless said to the king, ‘This situation is difficult to believe.

source: རེ་ཤིག་སྐད་ཅིག་སྡོད་ཅིག་དང་། །
en: Let them stop for a minute.’

source: བདག་བསད་པ་ཡི་ལོང་ཡོད་དོ། །རྒྱལ་པོས་དགེ་སློང་ཚིག་ཐོས་ནས། །གཤེད་མ་དག་ལ་སྡོད་ཅིག་བསྒོ། །
en: “When the king heard what the monk said, He ordered the executioners to stop.

source: བདེན་པའི་དངོས་པོ་ཅི་ཞིག་ཡོད། །
en: ‘What is the true situation?

source: ཁྱོད་ཀྱིས་མྱུར་དུ་སྨྲ་བའི་རིགས། །
en: You had better speak quickly!’

source: ལྷག་པའི་བསམ་པ་ལྡན་གྱུར་ཅིང་། །སྙིང་རྗེས་འཇིག་རྟེན་ཕན་འདོགས་པས། །སོར་མོ་བཅུ་ཡི་ཐལ་སྦྱར་ཏེ། །བདེན་པའི་ཚིག་ནི་འདི་སྐད་སྨྲས། །
en: “Becoming very sincere, Stainless said, ‘Since compassion benefits the world, I join my palms and ten fingers And speak the truth.

source: རྒྱལ་པོ་ཆེན་པོས་མཁྱེན་པར་མཛོད། །གལ་ཏེ་ཡང་དག་ཉེས་མེད་ན། །ས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས། །མཁའ་ལས་མེ་ཏོག་ཆར་ཕོབ་ཤིག །
en: “ ‘Let the great king know: If I am really innocent, May the earth shake six times, And may flowers rain from the sky.’

source: དེ་སྐད་ཚིག་ནི་སྨྲས་མ་ཐག །ས་ཆེན་རྣམ་པ་དྲུག་ཏུ་གཡོས། །མཁའ་ལས་ལྷ་ཡི་མེ་ཏོག་བབ། །བདུད་འཁོར་མྱ་ངན་སྐྱེས་པར་གྱུར། །
en: “As soon as he said this, The great earth shook six times, Heavenly flowers fell from the sky, And the māra’s army experienced misery.

source: དེ་ཚེ་རྒྱལ་པོ་དང་བ་སྐྱེས། །
en: “Then the king became calm.

source: རྐང་ལ་ཕྱག་བྱས་བཟོད་པ་གསོལ། །བདག་ནི་དམྱལ་བར་ལྟུང་འགྱུར་ན། །མགོན་མེད་བདག་ལ་སྐྱབས་མཛོད་ཅིག །
en: He bowed at Stainless’s feet and begged forgiveness: ‘If I fall to hell, Unprotected, I beg you to save me.

source: ཀྱི་ཧུད་སྡིག་པའི་གྲོགས་ཕྲད་པས། །གདུག་པའི་སེམས་ནི་སྐྱེས་པར་གྱུར། །
en: “ ‘Alas, since I met bad friends, I had a bad state of mind.

source: སྡིག་པའི་གྲོགས་པོ་རྗེས་འབྲངས་པས། །མགོན་དང་སྐྱབས་བྱེད་སུ་ཡང་མེད། །
en: Because I followed bad friends, I have no one to protect or save me.

source: སྟོན་པ་ཆེན་པོ་མ་གཏོགས་པར། །ཕྱོགས་བཅུར་བདག་གི་མགོན་བྱེད་མེད། །
en: “ ‘Except for the great teacher, In the ten directions I have no protection.

source: བདག་གིས་རྒྱལ་སྲིད་སྤངས་ནས་ནི། །ནམ་འཚོའི་བར་དུ་སྐྱབས་སུ་མཆིས། །
en: I give up my royalty, And now I take refuge for the rest of my life.’

source: དགེ་སློང་དེས་ནི་རྒྱལ་པོ་དང་། །གཡོག་འཁོར་བསམ་པ་རིག་གྱུར་ནས། །དམ་པའི་དོན་ནི་རབ་ཏུ་བཤད། །
en: “That monk, after he recognized the intention of the king And his servants and retinue, Set forth the highest truth.

source: རྒྱལ་པོས་ཐོས་ནས་དང་བ་ཐོབ། །འཁོར་ནི་བྱེ་བ་བརྒྱ་སྟོང་དང་། །རྒྱལ་སྲིད་སྤངས་ནས་རབ་ཏུ་བྱུང་། །སྦྱངས་པའི་སྡོམ་པ་བླངས་པས་ན། །
en: The king, hearing it, obtained sincere faith.
